{
  "backend/main.mo": "Main actor defining motorcycle club management system with 11 member roles (president through member/prospect), access control, blob storage, events, news feed, members roster, and user profiles with role-based ordering and comparison logic.",
  "backend/migration.mo": "Migration module converting old 7-role system (president, vicePresident, roadCaptain, secretary, treasurer, member, guest) to new 11-role system by mapping guest to prospect and adding sergeantAtArms, enforcer, tailGunner, and chaplain roles.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: role selector dropdown update, members roster role icons/badges update, and member management page role icons update, all with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages (HomePage, MembersPage with 11 role icons, EventsPage, NewsPage, GalleryPage, MemberManagementPage), components (Navbar, LoginButton, ProfileSetupModal, EventCard, NewsCard), hooks (useMembers, useEvents, useNewsFeed, useGetCallerUserProfile, useSaveCallerUserProfile), and styling (index.css with motorcycle club theme).",
  "frontend/index.css": "Tailwind CSS base styles defining light and dark theme color variables using oklch color space with motorcycle club aesthetic (dark backgrounds, metallic accents, blood-red destructive colors).",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Reapers Asylum MC' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup defining 8 routes (home, members, events, news, gallery, admin, profile, member-management), ThemeProvider with dark default, Layout with Navbar/footer, ProfileSetupModal, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying ShieldAlert icon, error message, and navigation buttons to home or profile page for users lacking admin privileges.",
  "frontend/src/components/AdminBadge.tsx": "Reusable admin badge component displaying Shield icon with 'Admin' text in destructive variant with blood-glow effect.",
  "frontend/src/components/EventCard.tsx": "Displays a single event in a card format with title, type badge, description, date/time, and location. Converts nanosecond timestamps to formatted dates and applies type-specific styling.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button that toggles Internet Identity authentication and clears the query cache on logout. Shows loading state during authentication.",
  "frontend/src/components/Navbar.tsx": "Main navigation component with logo, desktop/mobile menus, conditional links based on auth/admin status, and user profile display. Includes responsive mobile menu toggle.",
  "frontend/src/components/NewsCard.tsx": "Displays a news article in a card with title, author, timestamp, and content. Converts nanosecond timestamps to readable dates.",
  "frontend/src/components/PostNewsForm.tsx": "Form component for admins to post news announcements with title and content fields. Uses caller's user profile name as the author.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that appears for authenticated users without profiles, prompting them to enter name and bio. Checks and displays toast if user becomes first admin.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAddMember.ts": "Mutation hook to add a new member with name, role, photo URL, and bio, invalidating the members query on success.",
  "frontend/src/hooks/useAssignUserRole.ts": "Mutation hook to assign a user role to a principal, invalidating admin and role-related queries on success.",
  "frontend/src/hooks/useDeleteMember.ts": "Mutation hook to delete a member by ID, invalidating the members query and showing toast notifications.",
  "frontend/src/hooks/useEvents.ts": "Query hook that fetches all events from the backend actor when available.",
  "frontend/src/hooks/useGetAdminList.ts": "Disabled query hook that would fetch admin list, but backend doesn't expose this method so it returns empty array.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile, handling loading states from both actor and query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "React Query hook that checks if the current authenticated user has admin privileges by calling the backend actor's isCallerAdmin method.",
  "frontend/src/hooks/useMembers.ts": "React Query hook that fetches the list of club members from the backend actor.",
  "frontend/src/hooks/useNewsFeed.ts": "React Query hook that fetches news items from the backend and sorts them by timestamp in descending order.",
  "frontend/src/hooks/usePostNews.ts": "React Query mutation hook for posting news items to the backend, invalidating the news feed cache on success.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook for saving the current user's profile, invalidating both profile and admin status queries on success.",
  "frontend/src/hooks/useUpdateMember.ts": "React Query mutation hook for updating member information with toast notifications, invalidating the members cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom motorcycle club theme including color variables for light/dark modes, custom fonts (Bebas Neue, Oswald, Teko), and utility classes for metal/chrome/leather effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminManagementPage.tsx": "Admin-only page for managing user roles and admin privileges, allowing admins to grant or revoke admin access using principal IDs with validation and access control.",
  "frontend/src/pages/EventsPage.tsx": "Members-only page displaying club events with authentication check, loading states, and a road banner header.",
  "frontend/src/pages/GalleryPage.tsx": "Members-only photo gallery page with authentication check and placeholder content indicating the gallery feature is coming soon.",
  "frontend/src/pages/HomePage.tsx": "Landing page component displaying hero section with club logo, mission statement, and feature cards linking to members, events, news, and gallery sections. Shows authentication-dependent content and uses Internet Identity for login state.",
  "frontend/src/pages/MemberManagementPage.tsx": "Admin-only page for CRUD operations on club members with form inputs for name, role, photo URL, and bio. Includes role icons/labels mapping, access control via useIsCallerAdmin hook, and AlertDialog for delete confirmations.",
  "frontend/src/pages/MembersPage.tsx": "Authenticated page displaying club roster in a card grid with member photos, names, roles, and bios. Uses role-based icons and badges with authentication check requiring Internet Identity login.",
  "frontend/src/pages/NewsPage.tsx": "Authenticated news feed page showing club announcements with admin-only PostNewsForm component for creating posts. Displays NewsCard components for each post with loading skeletons and empty state.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying authenticated user's principal ID, name, club role, and join date with copy-to-clipboard functionality. Shows admin badge if user has admin privileges and redirects unauthenticated users to home.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space (including motorcycle club themed colors like metal, chrome, leather, blood-red), container settings, border radius variables, custom shadows, and keyframe animations for accordions and pulse effects.",
  "project_state.json": "Project state file documenting the Reapers Asylum MC motorcycle club app with 11 existing features including homepage, member roster, events calendar, Internet Identity authentication, news feed, photo gallery, admin management, and a bold motorcycle club aesthetic theme."
}