{
  "backend/main.mo": "Main Motoko actor defining the backend with access control, blob storage, user profiles, member roles (president to guest), events, news feed, and CRUD operations for club management.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (homepage, members roster, events calendar, authentication, news feed, gallery) to their source files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration files for the motorcycle club application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining colors for motorcycle club aesthetic (metal, chrome, leather, blood-red) and component styling tokens.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, page title 'Reapers Asylum MC', and script reference to main.tsx module.",
  "frontend/src/App.tsx": "Root application component setting up TanStack Router with routes for all pages (home, members, events, news, gallery), ThemeProvider, Layout with Navbar/footer, ProfileSetupModal, and Toaster.",
  "frontend/src/components/EventCard.tsx": "Reusable card component displaying event details (title, type badge, description, date/time, location) with icons and type-based styling variants.",
  "frontend/src/components/LoginButton.tsx": "Authentication button using Internet Identity hook with login/logout functionality, loading states, error handling for duplicate auth, and query cache clearing on logout.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component with responsive mobile menu, authentication-gated links (Members, Events, News, Gallery), club logo, and user profile display with login button.",
  "frontend/src/components/NewsCard.tsx": "Card component that displays a news item with title, content, author, and formatted timestamp.",
  "frontend/src/components/PostNewsForm.tsx": "Form component for posting news announcements with title and content fields, using the user's profile name as the author.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that appears for authenticated users without a profile, prompting them to enter name and bio to complete profile setup.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useEvents.ts": "React Query hook that fetches the list of events from the backend actor.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "React Query hook that checks if the current authenticated user has admin privileges.",
  "frontend/src/hooks/useMembers.ts": "React Query hook that fetches the list of club members from the backend actor.",
  "frontend/src/hooks/useNewsFeed.ts": "React Query hook that fetches and sorts news items by timestamp in descending order.",
  "frontend/src/hooks/usePostNews.ts": "React Query mutation hook for posting news with title, content, and author, invalidating the news feed cache on success.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook for saving the current user's profile, invalidating the profile cache on success.",
  "frontend/src/index.css": "Global CSS file that imports Google fonts (Bebas Neue, Oswald, Teko), configures Tailwind CSS, and defines extensive CSS custom properties for light/dark themes with a motorcycle club aesthetic including metal, chrome, leather, and blood-red color variables.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/EventsPage.tsx": "Displays a list of club events with authentication check, showing a road banner header and event cards fetched via useEvents hook, with loading skeletons and empty states.",
  "frontend/src/pages/GalleryPage.tsx": "Photo gallery page that requires authentication and currently shows a placeholder message indicating the gallery feature is coming soon.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section with club logo, mission statement, and a grid of feature cards linking to Members, Events, News, and Gallery sections.",
  "frontend/src/pages/MembersPage.tsx": "Displays club member roster in a card grid with role badges and icons, requiring authentication and using useMembers hook to fetch member data with role-based styling.",
  "frontend/src/pages/NewsPage.tsx": "News feed page that displays club announcements, includes admin-only PostNewsForm component for creating posts, and uses useNewsFeed hook to fetch news items.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with motorcycle club aesthetic colors (metal, chrome, leather, blood-red), custom shadows, border radius variables, and animation keyframes for accordions and pulse effects.",
  "project_state.json": "Project state file for Reapers Asylum MC motorcycle club app tracking 7 implemented features (homepage, member roster, events calendar, Internet Identity auth, news feed, photo gallery, and edgy visual theme) with image requirements for club branding assets."
}