{
  "backend/main.mo": "Main Motoko actor implementing a motorcycle club management system with access control, blob storage, user profiles, members, events, and news feed functionality including role-based permissions and CRUD operations.",
  "feature_evidence.json": "Feature evidence report documenting two features related to debugging and fixing the logo image display issue and regenerating missing logo files in the frontend public assets directory.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing components, pages, hooks, and styling for the Reapers Asylum MC application with corrected logo paths and authentication features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for the motorcycle club themed application.",
  "frontend/index.html": "HTML entry point for the Reapers Asylum MC application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for home, members, events, news, gallery, admin, profile, and member management pages, wrapped in ThemeProvider with shared Layout component.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying an error message with navigation options when users attempt to access admin-only pages without proper permissions.",
  "frontend/src/components/AdminBadge.tsx": "Reusable badge component displaying an admin indicator with shield icon and blood-glow styling effect.",
  "frontend/src/components/EventCard.tsx": "Event card component displaying event details including title, type badge, description, date, time, and location with formatted timestamps and event-specific styling.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component managing Internet Identity login/logout with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component with responsive mobile menu, authentication-aware links, admin badge display, and user profile access. Conditionally renders navigation items based on authentication status and admin privileges.",
  "frontend/src/components/NewsCard.tsx": "Card component that displays a single news item with title, content, author, and formatted timestamp. Uses lucide-react icons and shadcn/ui Card components.",
  "frontend/src/components/PostNewsForm.tsx": "Form component for admins to post news announcements with title and content fields. Uses usePostNews hook and displays loading states with toast notifications.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that appears for authenticated users without profiles, prompting them to set up name and bio. Checks for admin privileges after profile creation and displays a special toast if granted.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with authentication, handling both anonymous and authenticated states. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAddMember.ts": "Mutation hook for adding new members with name, role, photo URL, and bio. Invalidates members query and shows toast notifications on success/error.",
  "frontend/src/hooks/useAssignUserRole.ts": "Mutation hook for assigning user roles (admin privileges) to principals. Invalidates admin-related queries after successful role assignment.",
  "frontend/src/hooks/useDeleteMember.ts": "Mutation hook for deleting members by ID. Invalidates members query and displays toast notifications on success/error.",
  "frontend/src/hooks/useEvents.ts": "Query hook that fetches all events from the backend actor. Enabled only when actor is available and not fetching.",
  "frontend/src/hooks/useGetAdminList.ts": "Query hook for fetching admin list, currently disabled as the backend doesn't expose a getAdmins() method. Returns empty array.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile. Returns null if no profile exists and handles loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and auth client creation with configurable options. Provides status flags for various authentication states.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "Query hook that checks if the current authenticated user has admin privileges. Returns false if no actor is available.",
  "frontend/src/hooks/useMembers.ts": "Query hook that fetches all members from the backend actor. Enabled only when actor is available and not fetching.",
  "frontend/src/hooks/useNewsFeed.ts": "Query hook that fetches news feed items and sorts them by timestamp in descending order. Enabled only when actor is available.",
  "frontend/src/hooks/usePostNews.ts": "Mutation hook for posting news with title, content, and author. Invalidates newsFeed query on success.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React hook that provides a mutation to save the current user's profile and invalidates related queries (currentUserProfile and isCallerAdmin) on success.",
  "frontend/src/hooks/useUpdateMember.ts": "React hook that provides a mutation to update a member's details (name, role, photo, bio), invalidates the members query on success, and shows toast notifications.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, custom CSS variables for light/dark themes with motorcycle/metal aesthetic (chrome, leather, blood-red), and custom utility classes for metal gradients and textures.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminManagementPage.tsx": "Admin-only page for managing administrator privileges, allowing admins to grant or revoke admin roles by entering principal IDs with validation and access control.",
  "frontend/src/pages/EventsPage.tsx": "Members-only page displaying club events with a road banner header, requiring authentication and showing event cards or empty state.",
  "frontend/src/pages/GalleryPage.tsx": "Members-only page placeholder for photo gallery feature with authentication check and coming soon message.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section featuring club logo, mission statement, and feature grid linking to members, events, news, and gallery sections.",
  "frontend/src/pages/MemberManagementPage.tsx": "Admin-only page for CRUD operations on club members with form for adding/editing members, role management with icons/badges, and delete confirmation dialogs.",
  "frontend/src/pages/MembersPage.tsx": "Displays the club roster with member cards showing names, roles, and role-specific icons/badges. Requires authentication and shows loading skeletons while fetching member data.",
  "frontend/src/pages/NewsPage.tsx": "Shows club news feed with posts displayed via NewsCard components. Admins see a PostNewsForm to create announcements; requires authentication to view.",
  "frontend/src/pages/ProfilePage.tsx": "Displays authenticated user's profile information including principal ID (with copy button), name, club role, bio, and join date. Shows admin badge if user is an admin.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support and cleanup methods for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, motorcycle club-themed colors (metal, chrome, leather, blood-red), custom shadows, and animation keyframes.",
  "project_state.json": "Project metadata tracking implemented features (homepage, members roster, events calendar, authentication, news feed, photo gallery, admin management), known issues (logo not displaying), and image requirements for the Reapers Asylum MC branding."
}