{
  "backend/main.mo": "Main actor defining motorcycle club management system with access control, blob storage, member roles (11 ranks from President to Member), events, news feed, membership applications, and user profiles with CRUD operations.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: fixing pending membership applications display issue and adding error handling to AdminManagementPage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including pages, components, hooks, and styling with motorcycle club theme, role-based access control, and admin functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using motorcycle club color scheme (dark backgrounds, metallic accents, blood-red destructive colors).",
  "frontend/index.html": "HTML entry point for Reapers Asylum MC application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup defining 8 routes (home, members, events, news, gallery, admin, profile, member-management), ThemeProvider, Layout with Navbar/Footer, ProfileSetupModal, and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied page component with ShieldAlert icon, error message, and navigation buttons to home and profile for users lacking admin privileges.",
  "frontend/src/components/AdminBadge.tsx": "Reusable admin badge component displaying Shield icon with blood-glow effect and uppercase 'ADMIN' text.",
  "frontend/src/components/EventCard.tsx": "Event card component displaying event details (title, type badge, description, date/time, location) with icons and type-specific badge variants.",
  "frontend/src/components/LoginButton.tsx": "Authentication button using Internet Identity hook with login/logout functionality, loading states, error handling for duplicate auth, and query cache clearing on logout.",
  "frontend/src/components/MembershipApplicationForm.tsx": "React component that renders a form for authenticated users to apply for membership, with validation for name (min 2 chars) and bio (min 20 chars), showing success/error states and hiding the form if user is already a member.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component with responsive mobile menu, authentication-aware links, admin-only sections, and displays user profile info with login/logout functionality.",
  "frontend/src/components/NewsCard.tsx": "Displays a single news item in a card format with title, content, author, and formatted timestamp.",
  "frontend/src/components/PostNewsForm.tsx": "Admin form component for posting news announcements with title and content fields, using the user's profile name as the author.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that forces new authenticated users to set up their profile (name and bio) before accessing the app, with special handling to detect and notify first-time admin privileges.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAddMember.ts": "Mutation hook for adding a new member with name, role, photo URL, and bio, invalidating the members query cache on success.",
  "frontend/src/hooks/useApproveApplication.ts": "Mutation hook for approving a membership application by Principal, invalidating pending applications and members queries on success.",
  "frontend/src/hooks/useAssignUserRole.ts": "Mutation hook for assigning a UserRole to a user Principal, invalidating admin and role-related queries on success.",
  "frontend/src/hooks/useDeleteMember.ts": "Mutation hook for deleting a member by ID, invalidating the members query cache and showing toast notifications.",
  "frontend/src/hooks/useEvents.ts": "Query hook that fetches all events from the backend actor.",
  "frontend/src/hooks/useGetAdminList.ts": "Disabled query hook that would fetch admin list but is not implemented because the backend doesn't expose a getAdmins() method.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile, returning null if no profile exists and tracking both actor and query loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "React Query hook that checks if the current authenticated user has admin privileges by calling the backend actor's isCallerAdmin method.",
  "frontend/src/hooks/useMembers.ts": "React Query hook that fetches and returns the list of club members from the backend actor.",
  "frontend/src/hooks/useNewsFeed.ts": "React Query hook that fetches news items from the backend and sorts them by timestamp in descending order.",
  "frontend/src/hooks/usePendingApplications.ts": "React Query hook that fetches pending membership applications, only enabled when the user is an authenticated admin with detailed console logging.",
  "frontend/src/hooks/usePostNews.ts": "React Query mutation hook for posting news items to the backend, invalidating the news feed cache on success.",
  "frontend/src/hooks/useRejectApplication.ts": "React Query mutation hook for rejecting membership applications by Principal, showing toast notifications and invalidating the pending applications cache.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook for saving the current user's profile, invalidating both profile and admin status queries on success.",
  "frontend/src/hooks/useSubmitApplication.ts": "React Query mutation hook for submitting membership applications with name and bio, showing toast notifications and invalidating the user profile cache.",
  "frontend/src/hooks/useUpdateMember.ts": "React Query mutation hook for updating member details (name, role, photo, bio) with toast notifications and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, motorcycle club aesthetic (metal, chrome, leather, blood-red), and custom font families (Bebas Neue, Oswald, Teko).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminManagementPage.tsx": "Admin-only page for managing user roles (granting/revoking admin privileges) and reviewing membership applications (approve/reject) with access control and detailed debug logging.",
  "frontend/src/pages/EventsPage.tsx": "Displays club events with a road banner header, requiring authentication and showing loading states, error handling, and empty states.",
  "frontend/src/pages/GalleryPage.tsx": "Members-only photo gallery page with authentication check, currently showing a placeholder for future photo display functionality.",
  "frontend/src/pages/HomePage.tsx": "Landing page component displaying hero section with club logo, mission statement, feature cards (Members, Events, News, Gallery), and conditionally shows membership application form for authenticated users without a member role.",
  "frontend/src/pages/MemberManagementPage.tsx": "Admin-only page for managing club members with CRUD operations (add, update, delete), role assignment, and displays member cards with role icons and badges. Includes form handling for member data and access control checks.",
  "frontend/src/pages/MembersPage.tsx": "Displays the club roster with member cards showing names, roles, photos, and bios. Requires authentication and includes role-based icons and badges with loading and error states.",
  "frontend/src/pages/NewsPage.tsx": "Shows club news feed with authentication requirement, displays news cards, and conditionally renders PostNewsForm for admin users. Includes loading skeletons and empty state handling.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying authenticated user's information including principal ID (with copy functionality), name, club role, bio, and admin badge if applicable. Redirects unauthenticated users to home.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space (including motorcycle club themed colors like metal, chrome, leather, blood-red), container settings, border radius variables, custom shadows, and keyframe animations for accordions and pulse effects.",
  "project_state.json": "Project state file documenting the Reapers Asylum MC motorcycle club app with 11 existing features including homepage, member roster, events calendar, Internet Identity authentication, news feed, photo gallery, admin management, and a bold motorcycle club aesthetic theme."
}