{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update member roles to include all motorcycle club ranks",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Update the role selector dropdown in the Member Management page to include all standard motorcycle club ranks",
      "acceptanceCriteria": [
        "Add member form displays all MC ranks in dropdown",
        "Edit member form displays all MC ranks in dropdown",
        "All ranks are properly capitalized and formatted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MemberManagementPage.tsx",
          "operation": "modify",
          "description": "Update the role selector dropdown to include all standard motorcycle club ranks: President, Vice President, Road Captain, Secretary, Sergeant at Arms, Treasurer, Enforcer, Tail Gunner, Chaplain, Prospect, and Member. Ensure the dropdown displays all ranks with proper capitalization and formatting in both add and edit member forms."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Update the Members roster page role icons and badges to visually represent all motorcycle club ranks with appropriate icons",
      "acceptanceCriteria": [
        "Each MC rank displays with a unique, appropriate icon",
        "Role badges maintain consistent styling with existing design",
        "Icons are sourced from lucide-react library for consistency"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MembersPage.tsx",
          "operation": "modify",
          "description": "Update role icons and badges to represent all motorcycle club ranks with appropriate lucide-react icons: President (Crown), Vice President (Star), Road Captain (Compass), Secretary (Clipboard), Sergeant at Arms (Shield), Treasurer (DollarSign), Enforcer (Flame), Tail Gunner (ShieldCheck), Chaplain (Heart), Prospect (UserPlus), and Member (User). Maintain consistent styling with existing motorcycle club theme and ensure each rank displays its unique icon."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Update the Member Management page role icons to match the expanded set of motorcycle club ranks",
      "acceptanceCriteria": [
        "Member Management page displays same icons as Members roster",
        "Icons appear correctly in the member list table",
        "Visual styling matches the existing motorcycle club theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MemberManagementPage.tsx",
          "operation": "modify",
          "description": "Update role icons in the member list table to match the expanded set of motorcycle club ranks using the same icon mapping as the Members roster page (President: Crown, Vice President: Star, Road Captain: Compass, Secretary: Clipboard, Sergeant at Arms: Shield, Treasurer: DollarSign, Enforcer: Flame, Tail Gunner: ShieldCheck, Chaplain: Heart, Prospect: UserPlus, Member: User). Ensure visual styling matches the existing motorcycle club theme and maintains consistency with the Members roster page."
        }
      ]
    }
  ]
}